Speeds/v4/system/snappyHexMeshDict.2
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
	version    2.0;
	format     ascii;
	class      dictionary;
	object     snappyHexMeshDict;
}


blSpecsDict
{
#include "$FOAM_CASE/system/blSpecsDict"
}



	castellatedMesh false;
	snap            false;
	addLayers        true;

geometry
{

}




castellatedMeshControls
{
	maxLocalCells 5000000;
	maxGlobalCells 2000000000;
	minRefinementCells 1;
	maxLoadUnbalance 0.1;
	nCellsBetweenLevels 3;
	resolveFeatureAngle 30;
	locationInMesh (-1 -0.11 -0.11);
	allowFreeStandingZoneFaces true;


       features
	(
	 );

        refinementSurfaces
	{
	};

        refinementRegions
	{
	};


}
snapControls
{
	nSmoothPatch             10;
	nSmoothInternal           30;
	tolerance                 2.0;
	nSolveIter                50;
	nRelaxIter                10;
	nFeatureSnapIter          10;
	detectNearSurfaceSnap     true;
	implicitFeatureSnap       false;
	explicitFeatureSnap       true;
	multiRegionFeatureSnap    false;
}

addLayersControls
{
	meshShrinker displacementMotionSolver;
	solver       displacementLaplacian;
	displacementLaplacianCoeffs
	{
		diffusivity    quadratic inverseDistance 1(wall);
	}

	layers
	{
		ship_deck
		{
			nSurfaceLayers 0;
	}
		ship_hub
		{
			nSurfaceLayers 1;
	}
		ship_hull
		{
			nSurfaceLayers 1;
	}
	}

	relativeSizes true;
//	thicknessModel firstAndRelativeFinal;
//	firstLayerThickness 0.00319;
	finalLayerThickness 0.6;
	expansionRatio 1.2;
	minThickness 0.0001;
	nGrow 0;
	featureAngle 180;
	slipFeatureAngle 45;
	layerTerminationAngle 45;
	nRelaxIter 5;
	nSmoothSurfaceNormals 1;
	nSmoothNormals 3;
	nSmoothThickness 10;
	maxFaceThicknessRatio 0.5;
	maxThicknessToMedialRatio 0.3;
	minMedianAxisAngle 90;
	nBufferCellsNoExtrude 1;
	nLayerIter 50;
	nOuter 5;
	nRelaxedIter 20;
	
}

meshQualityControls
{

#include "meshQualityDict.2"
}

writeFlags
(
//    scalarLevels
    layerSets
    layerFields
);
debugFlags
(
//layerInfo
);

mergeTolerance 1e-06;
